In [1]:
import pandas as  pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
l = [4,8, 15, 16, 23,42]

In [15]:
pd.Series(l)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [16]:
l2 = ["raj" for _ in range (0,11)]

In [17]:
pd.Series(l2)

0     raj
1     raj
2     raj
3     raj
4     raj
5     raj
6     raj
7     raj
8     raj
9     raj
10    raj
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [18]:
dict1 = {"name":["Alice","Bob","Claire"],
        "Age":[25,30,11],
        "Gender":["Female","Male","Female"]}

In [19]:
dict1

{'name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 11],
 'Gender': ['Female', 'Male', 'Female']}

In [21]:
pd.DataFrame(dict1)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   11  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
Dataframe is storing data in a table tabular format with mutiple rows and columns
Series is a single row

a DataFrame is a two-dimensional tabular data structure that consists of rows and columns. It can be thought of as a collection of Pandas Series objects, where each column represents a Series.

In [22]:
#dataframe
pd.DataFrame(dict1)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   11  Female

In [25]:
#series
pd.Series(dict1['name'])

0     Alice
1       Bob
2    Claire
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
head tail isnull dtypes describe lapply and lot more functions are used for manipilation

In [26]:
df=pd.DataFrame(dict1)

In [27]:
df

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   11  Female

In [28]:
df.head(1)

    name  Age  Gender
0  Alice   25  Female

In [29]:
df.tail(1)

     name  Age  Gender
2  Claire   11  Female

In [31]:
df.columns

Index(['name', 'Age', 'Gender'], dtype='object')

In [33]:
df.describe()

             Age
count   3.000000
mean   22.000000
std     9.848858
min    11.000000
25%    18.000000
50%    25.000000
75%    27.500000
max    30.000000

In [34]:
df.dtypes

name      object
Age        int64
Gender    object
dtype: object

In [36]:
df.shape

(3, 3)

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
both Series and DataFrame are mutable in nature, while Panel is not and has been deprecated in recent versions of pandas.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [41]:
s1 = df["name"]
s1

0     Alice
1       Bob
2    Claire
Name: name, dtype: object

In [42]:
s2 = df["Age"]
s2

0    25
1    30
2    11
Name: Age, dtype: int64

In [43]:
s3 = df["Gender"]
s3

0    Female
1      Male
2    Female
Name: Gender, dtype: object

In [49]:
pd.concat([s1,s2,s3],axis=1)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   11  Female